mathletema/2048/psoc5/codegentemp/Design01.svd
        <register>
          <name>TouchScreen_ADC_DSM_CR8</name>
          <description>Delta Sigma Modulator Control Register 8</description>
          <addressOffset>0x40005888</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>ipcap2_en</name>
              <description>Enable/Disable additional 50fF capacitance path in the second integrator's input sampling path.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IPCAP2_EN_DISABLE</name>
                  <description>Disable the additional 50fF capacitance path.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPCAP2_EN_ENABLE</name>
                  <description>Enable the additional 50fF capacitance path.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ipcap2</name>
              <description>The second integrator's input sampling capacitance (0-350fF, 50fF step).</description>
              <lsb>4</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IPCAP2_0FEMPTO</name>
                  <description>0fF.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPCAP2_50FEMPTO</name>
                  <description>50fF.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPCAP2_100FEMPTO</name>
                  <description>100fF.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPCAP2_150FEMPTO</name>
                  <description>150fF.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPCAP2_200FEMPTO</name>
                  <description>200fF.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPCAP2_250FEMPTO</name>
                  <description>250fF.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPCAP2_300FEMPTO</name>
                  <description>300fF.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPCAP2_350FEMPTO</name>
                  <description>350fF.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>fcap2</name>
              <description>The second stage integrating capacitance (0-750fF, 50fF step).</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FCAP2_0FEMPTO</name>
                  <description>0fF.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAP2_50FEMPTO</name>
                  <description>50fF.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAP2_100FEMPTO</name>
                  <description>100fF.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAP2_150FEMPTO</name>
                  <description>150fF.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAP2_200FEMPTO</name>
                  <description>200fF.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAP2_250FEMPTO</name>
                  <description>250fF.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAP2_300FEMPTO</name>
                  <description>300fF.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAP2_350FEMPTO</name>
                  <description>350fF.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAP2_400FEMPTO</name>
                  <description>400fF.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAP2_450FEMPTO</name>
                  <description>450fF.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAP2_500FEMPTO</name>
                  <description>500fF.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAP2_550FEMPTO</name>
                  <description>550fF.</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAP2_600FEMPTO</name>
                  <description>600fF.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAP2_650FEMPTO</name>
                  <description>650fF.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAP2_700FEMPTO</name>
                  <description>700fF.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAP2_750FEMPTO</name>
                  <description>750fF.</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TouchScreen_ADC_DSM_CR9</name>
          <description>Delta Sigma Modulator Control Register 9</description>
          <addressOffset>0x40005889</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>ipcap3_en</name>
              <description>Enable/Disable additional 50fF capacitance path in the second integrator's input sampling path.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IPCAP3_EN_DISABLE</name>
                  <description>Disable the additional 50fF capacitance path.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPCAP3_EN_ENABLE</name>
                  <description>Enable the additional 50fF capacitance path.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ipcap3</name>
              <description>The third integrator's input sampling capacitance (0-350fF in 50fF step).</description>
              <lsb>4</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IPCAP3_0FEMPTO</name>
                  <description>0fF.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPCAP3_50FEMPTO</name>
                  <description>50fF.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPCAP3_100FEMPTO</name>
                  <description>100fF.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPCAP3_150FEMPTO</name>
                  <description>150fF.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPCAP3_200FEMPTO</name>
                  <description>200fF.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPCAP3_250FEMPTO</name>
                  <description>250fF.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPCAP3_300FEMPTO</name>
                  <description>300fF.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPCAP3_350FEMPTO</name>
                  <description>350fF.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>fcap3</name>
              <description>The third stage integrating capacitance (0-1500fF, 100fF step).</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FCAP3_0FEMPTO</name>
                  <description>0fF.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAP3_100FEMPTO</name>
                  <description>100fF.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAP3_200FEMPTO</name>
                  <description>200fF.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAP3_300FEMPTO</name>
                  <description>300fF.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAP3_400FEMPTO</name>
                  <description>400fF.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAP3_500FEMPTO</name>
                  <description>500fF.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAP3_600FEMPTO</name>
                  <description>600fF.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAP3_700FEMPTO</name>
                  <description>700fF.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAP3_800FEMPTO</name>
                  <description>800fF.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAP3_900FEMPTO</name>
                  <description>900fF.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAP3_1000FEMPTO</name>
                  <description>1000fF.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAP3_1100FEMPTO</name>
                  <description>1100fF.</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAP3_1200FEMPTO</name>
                  <description>1200fF.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAP3_1300FEMPTO</name>
                  <description>1300fF.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAP3_1400FEMPTO</name>
                  <description>1400fF.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAP3_1500FEMPTO</name>
                  <description>1500fF.</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TouchScreen_ADC_DSM_CR10</name>
          <description>Delta Sigma Modulator Control Register 10</description>
          <addressOffset>0x4000588A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>sumcap1_en</name>
              <description>Enabling/Disabling the the additional 50fF capacitance path that lies between first integrator output and summer input (feed-forward) path.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUMCAP1_EN_DISABLE</name>
                  <description>Disable the additional 50fF capacitance path.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAP1_EN_ENABLE</name>
                  <description>Enable the additional 50fF capacitance path.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>sumcap1</name>
              <description>The summer capacitance that lies on the feed-forward path from the first integrator output (0fF to 350fF in 50fF step).</description>
              <lsb>4</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUMCAP1_0FEMPTO</name>
                  <description>0fF.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAP1_50FEMPTO</name>
                  <description>50fF.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAP1_100FEMPTO</name>
                  <description>100fF.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAP1_150FEMPTO</name>
                  <description>150fF.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAP1_200FEMPTO</name>
                  <description>200fF.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAP1_250FEMPTO</name>
                  <description>250fF.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAP1_300FEMPTO</name>
                  <description>300fF.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAP1_350FEMPTO</name>
                  <description>350fF.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>sumcap2_en</name>
              <description>Enabling/Disabling the additional 50fF capacitance path that lies between the second integrator output and summer input (feed-forward) path.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUMCAP2_EN_DISABLE</name>
                  <description>Disable the additional 50fF capacitance path.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAP2_EN_ENABLE</name>
                  <description>Enable the additional 50fF capacitance path.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>sumcap2</name>
              <description>The summer capacitance that lies on the feed-forward path from the second integrator output (0fF to 350fF in 50fF step.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUMCAP2_0FEMPTO</name>
                  <description>0fF.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAP2_50FEMPTO</name>
                  <description>50fF.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAP2_100FEMPTO</name>
                  <description>100fF.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAP2_150FEMPTO</name>
                  <description>150fF.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAP2_200FEMPTO</name>
                  <description>200fF.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAP2_250FEMPTO</name>
                  <description>250fF.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAP2_300FEMPTO</name>
                  <description>300fF.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAP2_350FEMPTO</name>
                  <description>350fF.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
