mathletema/2048/psoc5/codegentemp/Design01.svd
        <register>
          <name>TouchScreen_ADC_DSM_BUF1</name>
          <description>Delta Sigma Modulator Buffer Register 1</description>
          <addressOffset>0x4000589B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>gain</name>
              <description>Gain settings of 1,2,4,8 are supported.</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GAIN_1X</name>
                  <description>1x</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAIN_2X</name>
                  <description>2x</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAIN_4X</name>
                  <description>4x</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAIN_8X</name>
                  <description>8x</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>bypass_n</name>
              <description>Remove negative half of the buffer from signal path.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BYPASS_N_0</name>
                  <description>The buffer in the negative half remains on the signal path (Refer Fig 33-2)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYPASS_N_1</name>
                  <description>bypass the buffer on the negative half of the signal path (Refer Fig 33-2)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>enable_n</name>
              <description>Buffer Negative Half Enable.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE_N_0</name>
                  <description>power down buffer in negative half</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_N_1</name>
                  <description>enable negat half of buffer</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TouchScreen_ADC_DSM_BUF2</name>
          <description>Delta Sigma Modulator Buffer Register 2</description>
          <addressOffset>0x4000589C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>add_extra_rc</name>
              <description>If enabled an additional RC is included at the output of the buffer differentially, to lower noise at the expense of settling else normal settling. See s8hizbuf BROS for more information.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>lowpower_en</name>
              <description>Enables the lower power mode of operation. The normal power mode implies 600uA typical current consumption per opamp in the buffer. See s8hizbuf BROS for more information.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOWPOWER_EN_NORMAL</name>
                  <description>Input buffer operated in normal power mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOWPOWER_EN_LOW</name>
                  <description>Input buffer operated in low (1/4th of normal power) power mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TouchScreen_ADC_DSM_BUF3</name>
          <description>Delta Sigma Modulator Buffer Register 3</description>
          <addressOffset>0x4000589D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>buf_chop_en</name>
              <description>Enable/ Disable Chopping of the input buffer (TYPE A or B as selected in DSM_BUF0 register).</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BUF_CHOP_EN_0</name>
                  <description>Disable Chopping of the input buffer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUF_CHOP_EN_1</name>
                  <description>Enable Chopping of the input buffer</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>buf_fchop</name>
              <description>Input Buffer Chopping frequency control.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BUF_FCHOP_0</name>
                  <description>chopping frequency is fs/2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUF_FCHOP_1</name>
                  <description>chopping frequency is fs/4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUF_FCHOP_2</name>
                  <description>chopping frequency is fs/8</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUF_FCHOP_3</name>
                  <description>chopping frequency is fs/16</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUF_FCHOP_4</name>
                  <description>chopping frequency is fs/32</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUF_FCHOP_5</name>
                  <description>chopping frequency is fs/64</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUF_FCHOP_6</name>
                  <description>chopping frequency is fs/128</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUF_FCHOP_7</name>
                  <description>chopping frequency is fs/256</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TouchScreen_ADC_DSM_MISC</name>
          <description>Delta Sigma Modulator Miscallaneous Register</description>
          <addressOffset>0x4000589E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>swvn_src</name>
              <description>negative input routing control source.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DSM_SWVN_SRC_REG</name>
                  <description>ANAIF DSM routing registers</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSM_SWVN_SRC_UDB</name>
                  <description>UDB</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>swvp_src</name>
              <description>positive input routing control source.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DSM_SWVP_SRC_REG</name>
                  <description>ANAIF DSM routing registers</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSM_SWVP_SRC_UDB</name>
                  <description>UDB</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>sel_iclk_cp</name>
              <description>Select Charge Pump Internal Clock.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEL_ICLK_CP_EXTERNAL</name>
                  <description>External (DSI) Charge Pump Clock selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL_ICLK_CP_INTERNAL</name>
                  <description>Internal Charge Pump Clock selected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TouchScreen_ADC_DSM_CLK</name>
          <description>Delta Sigma Modulator Clock Selection Register</description>
          <addressOffset>0x40005B07</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>bypass_sync</name>
              <description>Bypass Synchronization</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BYPASS_SYNC_0</name>
                  <description>Synchronization not bypassed (Synchronization enabled)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYPASS_SYNC_1</name>
                  <description>Synchronization bypassed (Synchronization disabled)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>clk_en</name>
              <description>Clock gating control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLK_EN_0</name>
                  <description>disable clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_EN_1</name>
                  <description>enable clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>mx_clk</name>
              <description>Clock Selection</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MX_CLK_0</name>
                  <description>Select clk_a0 and clk_a0_dig</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_CLK_1</name>
                  <description>Select clk_a1 and clk_a1_dig</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_CLK_2</name>
                  <description>Select clk_a2 and clk_a2_dig</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_CLK_3</name>
                  <description>Select clk_a3 and clk_a3_dig</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_CLK_4</name>
                  <description>Select UDB generated clock</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_CLK_5</name>
                  <description>Reserved</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_CLK_6</name>
                  <description>Reserved</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_CLK_7</name>
                  <description>Reserved</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TouchScreen_ADC_DSM_OUT0</name>
          <description>Delta Sigma Modulator Output Register 0</description>
          <addressOffset>0x40005B88</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>dout</name>
              <description>DSM output.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TouchScreen_ADC_DSM_OUT1</name>
          <description>Delta Sigma Modulator Output Register 1</description>
          <addressOffset>0x40005B89</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>ovdcause</name>
              <description>Overload Cause</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OVDCAUSE_0</name>
                  <description>0s overload</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVDCAUSE_1</name>
                  <description>1s overload</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ovdflag</name>
              <description>Overload detected</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>dout2scomp</name>
              <description>DSM Output Register 1</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DSM_DOUT2SCOMP_0</name>
                  <description>NA (qlev=00); 0 (qlev=01); 0 (qlev=10)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSM_DOUT2SCOMP_1</name>
                  <description>+1 (qlev=00); +1 (qlev=01); +1 (qlev=10)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSM_DOUT2SCOMP_2</name>
                  <description>NA (qlev=00); NA (qlev=01); +2 (qlev=10)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSM_DOUT2SCOMP_3</name>
                  <description>NA (qlev=00); NA (qlev=01); +3 (qlev=10)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSM_DOUT2SCOMP_4</name>
                  <description>NA (qlev=00); NA (qlev=01); +4 (qlev=10)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSM_DOUT2SCOMP_5</name>
                  <description>NA (qlev=00); NA (qlev=01); NA (qlev=10)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSM_DOUT2SCOMP_6</name>
                  <description>NA (qlev=00); NA (qlev=01); NA (qlev=10)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSM_DOUT2SCOMP_7</name>
                  <description>NA (qlev=00); NA (qlev=01); NA (qlev=10)</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSM_DOUT2SCOMP_8</name>
                  <description>NA (qlev=00); NA (qlev=01); NA (qlev=10)</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSM_DOUT2SCOMP_9</name>
                  <description>NA (qlev=00); NA (qlev=01); NA (qlev=10)</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSM_DOUT2SCOMP_10</name>
                  <description>NA (qlev=00); NA (qlev=01); NA (qlev=10)</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSM_DOUT2SCOMP_11</name>
                  <description>NA (qlev=00); NA (qlev=01); NA (qlev=10)</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSM_DOUT2SCOMP_12</name>
                  <description>NA (qlev=00); NA (qlev=01); -4 (qlev=10)</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSM_DOUT2SCOMP_13</name>
                  <description>NA (qlev=00); NA (qlev=01); -3 (qlev=10)</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSM_DOUT2SCOMP_14</name>
                  <description>NA (qlev=00); NA (qlev=01); -2 (qlev=10)</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSM_DOUT2SCOMP_15</name>
                  <description>-1 (qlev=00); -1 (qlev=01); -1 (qlev=10)</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>